---
kind: property
id: P:Autodesk.Revit.DB.Architecture.RoomTag.IsInRoom
source: html/10433dea-0c92-349a-ab14-f2969a315d02.htm
---
# Autodesk.Revit.DB.Architecture.RoomTag.IsInRoom Property

Identifies if the tag is located in a room.

## Syntax (C#)
```csharp
public bool IsInRoom { get; }
```

## Remarks
In some cases the tag may not be located in a room so it looses temporairly an association with the room.